/*****************************************************************************************************
* 模块名称: SendData.cs
* 摘    要: 向单片机发送命令
* 当前版本: 1.0.0
* 作    者: Leyutek(COPYRIGHT 2018 - 2021 Leyutek. All rights reserved.)
* 完成日期: 2021年01月10日
* 内    容: 
* 注    意:
******************************************************************************************************
* 取代版本: 
* 作    者: 
* 完成日期: 
* 修改内容: 
* 修改文件: 
*****************************************************************************************************/
using System;
using System.Collections.Generic;
using System.Linq;
using System.IO.Ports;

namespace FinalTest
{
    /*************************************************************************************************
    * 类 名 称: SendData
    * 功能说明: 发送命令类
    * 注    意:
    *************************************************************************************************/
    public class SendData
    {
        //定义串口变量
        public SerialPort mComPort;
        //实例化打包解包类
        PackUnpack mPackUnpack = new PackUnpack();

        /*********************************************************************************************
        * 方法名称: SendData
        * 功能说明: 构造方法
        * 参数说明：输入参数comPort-串口
        * 注    意: 将类中的串口与主界面同步
        *********************************************************************************************/
        public SendData(SerialPort comPort)
        {
            mComPort = comPort;
        }

        /*********************************************************************************************
        * 方法名称: sendCmdToMcu
        * 功能说明: 发送命令给从机
        * 参数说明：输入参数（1）datalst-包含二级ID和待发送数据（DAT1），输入参数（2）cmd-模块ID
        * 注    意:
        *********************************************************************************************/
        public void sendCmdToMcu(List<byte> datalst, Byte cmd)
        {
            if (!mComPort.IsOpen)
            {
                return;                    //串口没有打开，则返回
            }

            datalst.Insert(0, cmd);        //在list的第一个位置插入模块ID

            mPackUnpack.packData(ref datalst);          //打包

            byte[] buffer = datalst.ToArray<byte>();    //打包后转换成字节数组
            mComPort.Write(buffer, 0, buffer.Length);   //向串口发送数据包
        }
    }
}
